STMicroelectronics/stm32u5xx-hal-driver/Src/stm32u5xx_ll_fdcan.c
/**
  ******************************************************************************
  * @file    stm32u5xx_ll_fdcan.c
  * @author  MCD Application Team
  * @brief   FDCAN LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include <stddef.h>
#include "stm32u5xx_ll_fdcan.h"
#include "stm32u5xx_ll_bus.h"
#ifdef USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

#if defined(FDCAN1)

/** @addtogroup FDCAN_LL
  * @{
  */

/* Private constants ---------------------------------------------------------*/
/** @addtogroup FDCAN_LL_Private_Constants
  * @{
  */
#define LL_FDCAN_TIMEOUT_VALUE (10U)

#define FDCAN_ELEMENT_MASK_STDID (0x1FFC0000UL)
#define FDCAN_ELEMENT_MASK_EXTID (0x1FFFFFFFUL)
#define FDCAN_ELEMENT_MASK_RTR (0x20000000UL)
#define FDCAN_ELEMENT_MASK_XTD (0x40000000UL)
#define FDCAN_ELEMENT_MASK_ESI (0x80000000UL)
#define FDCAN_ELEMENT_MASK_TS (0x0000FFFFUL)
#define FDCAN_ELEMENT_MASK_DLC (0x000F0000UL)
#define FDCAN_ELEMENT_MASK_BRS (0x00100000UL)
#define FDCAN_ELEMENT_MASK_FDF (0x00200000UL)
#define FDCAN_ELEMENT_MASK_FIDX (0x7F000000UL)
#define FDCAN_ELEMENT_MASK_ANMF (0x80000000UL)

#define SRAMCAN_FLS_NBR LL_FDCAN_MAX_STD_FILTERS
#define SRAMCAN_FLE_NBR LL_FDCAN_MAX_EXT_FILTERS
#define SRAMCAN_RF0_NBR LL_FDCAN_MAX_RX_FIFO0_ELEMENTS
#define SRAMCAN_RF1_NBR LL_FDCAN_MAX_RX_FIFO1_ELEMENTS
#define SRAMCAN_TEF_NBR LL_FDCAN_MAX_TX_EVENT_FIFO_ELEMENTS
#define SRAMCAN_TFQ_NBR LL_FDCAN_MAX_TX_FIFO_QUEUE_ELEMENTS

#define SRAMCAN_FLS_SIZE (1U * 4U)
#define SRAMCAN_FLE_SIZE (2U * 4U)
#define SRAMCAN_RF0_SIZE (18U * 4U)
#define SRAMCAN_RF1_SIZE (18U * 4U)
#define SRAMCAN_TEF_SIZE (2U * 4U)
#define SRAMCAN_TFQ_SIZE (18U * 4U)

#define SRAMCAN_FLSSA (0U)
#define SRAMCAN_FLESA (SRAMCAN_FLSSA + (SRAMCAN_FLS_NBR * SRAMCAN_FLS_SIZE))
#define SRAMCAN_RF0SA (SRAMCAN_FLESA + (SRAMCAN_FLE_NBR * SRAMCAN_FLE_SIZE))
#define SRAMCAN_RF1SA (SRAMCAN_RF0SA + (SRAMCAN_RF0_NBR * SRAMCAN_RF0_SIZE))
#define SRAMCAN_TEFSA (SRAMCAN_RF1SA + (SRAMCAN_RF1_NBR * SRAMCAN_RF1_SIZE))
#define SRAMCAN_TFQSA (SRAMCAN_TEFSA + (SRAMCAN_TEF_NBR * SRAMCAN_TEF_SIZE))
#define SRAMCAN_SIZE LL_FDCAN_MESSAGE_RAM_SIZE
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @addtogroup FDCAN_LL_Private_Variables
  * @{
  */
static const uint8_t DLCtoBytes[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64};
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup FDCAN_LL_Private_Macros
  * @{
  */
#define IS_LL_FDCAN_CKDIV(__VALUE__)                                                   \
    (((__VALUE__) == LL_FDCAN_CLOCK_DIV1) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV2) ||   \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV4) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV6) ||   \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV8) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV10) ||  \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV12) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV14) || \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV16) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV18) || \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV20) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV22) || \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV24) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV26) || \
     ((__VALUE__) == LL_FDCAN_CLOCK_DIV28) || ((__VALUE__) == LL_FDCAN_CLOCK_DIV30))

#define IS_LL_FDCAN_FRAME_FORMAT(__VALUE__)                                                  \
    (((__VALUE__) == LL_FDCAN_FRAME_CLASSIC) || ((__VALUE__) == LL_FDCAN_FRAME_FD_NO_BRS) || \
     ((__VALUE__) == LL_FDCAN_FRAME_FD_BRS))

#define IS_LL_FDCAN_MODE(__VALUE__)                         \
    (((__VALUE__) == LL_FDCAN_MODE_NORMAL) ||               \
     ((__VALUE__) == LL_FDCAN_MODE_RESTRICTED_OPERATION) || \
     ((__VALUE__) == LL_FDCAN_MODE_BUS_MONITORING) ||       \
     ((__VALUE__) == LL_FDCAN_MODE_INTERNAL_LOOPBACK) ||    \
     ((__VALUE__) == LL_FDCAN_MODE_EXTERNAL_LOOPBACK))

#define IS_LL_FDCAN_STATE(__VALUE__)                          \
    (((__VALUE__) == LL_FDCAN_AUTO_RETRANSMISSION_ENABLE) ||  \
     ((__VALUE__) == LL_FDCAN_AUTO_RETRANSMISSION_DISABLE) || \
     ((__VALUE__) == LL_FDCAN_TRANSMIT_PAUSE_DISABLE) ||      \
     ((__VALUE__) == LL_FDCAN_TRANSMIT_PAUSE_ENABLE) ||       \
     ((__VALUE__) == LL_FDCAN_PROTOCOL_EXCEPTION_ENABLE) ||   \
     ((__VALUE__) == LL_FDCAN_PROTOCOL_EXCEPTION_DISABLE))

#define IS_LL_FDCAN_NOMINAL_PRESCALER(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 512U))
#define IS_LL_FDCAN_NOMINAL_SJW(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 128U))
#define IS_LL_FDCAN_NOMINAL_TSEG1(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 256U))
#define IS_LL_FDCAN_NOMINAL_TSEG2(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 128U))
#define IS_LL_FDCAN_DATA_PRESCALER(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 32U))
#define IS_LL_FDCAN_DATA_SJW(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 16U))
#define IS_LL_FDCAN_DATA_TSEG1(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 32U))
#define IS_LL_FDCAN_DATA_TSEG2(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 16U))
#define IS_LL_FDCAN_MAX_VALUE(__VALUE__, __MAX__) ((__VALUE__) <= (__MAX__))

#define IS_LL_FDCAN_TX_FIFO_QUEUE_MODE(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_TX_FIFO_OPERATION) || ((__VALUE__) == LL_FDCAN_TX_QUEUE_OPERATION))

#define IS_LL_FDCAN_ID_TYPE(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_STANDARD_ID) || ((__VALUE__) == LL_FDCAN_EXTENDED_ID))

#define IS_LL_FDCAN_FILTER_CFG(__VALUE__)                                                       \
    (((__VALUE__) == LL_FDCAN_FILTER_DISABLE) || ((__VALUE__) == LL_FDCAN_FILTER_TO_RXFIFO0) || \
     ((__VALUE__) == LL_FDCAN_FILTER_TO_RXFIFO1) || ((__VALUE__) == LL_FDCAN_FILTER_REJECT) ||  \
     ((__VALUE__) == LL_FDCAN_FILTER_HP) || ((__VALUE__) == LL_FDCAN_FILTER_TO_RXFIFO0_HP) ||   \
     ((__VALUE__) == LL_FDCAN_FILTER_TO_RXFIFO1_HP))

