STMicroelectronics/stm32u5xx-hal-driver/Src/stm32u5xx_ll_fdcan.c
#define IS_LL_FDCAN_STD_FILTER_TYPE(__VALUE__)                                          \
    (((__VALUE__) == LL_FDCAN_FILTER_RANGE) || ((__VALUE__) == LL_FDCAN_FILTER_DUAL) || \
     ((__VALUE__) == LL_FDCAN_FILTER_MASK))

#define IS_LL_FDCAN_EXT_FILTER_TYPE(__VALUE__)                                          \
    (((__VALUE__) == LL_FDCAN_FILTER_RANGE) || ((__VALUE__) == LL_FDCAN_FILTER_DUAL) || \
     ((__VALUE__) == LL_FDCAN_FILTER_MASK) || ((__VALUE__) == LL_FDCAN_FILTER_RANGE_NO_EIDM))

#define IS_LL_FDCAN_FRAME_TYPE(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_DATA_FRAME) || ((__VALUE__) == LL_FDCAN_REMOTE_FRAME))

#define IS_LL_FDCAN_DLC(__VALUE__)                                                       \
    (((__VALUE__) == LL_FDCAN_DLC_BYTES_0) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_1) ||   \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_2) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_3) ||   \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_4) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_5) ||   \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_6) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_7) ||   \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_8) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_12) ||  \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_16) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_20) || \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_24) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_32) || \
     ((__VALUE__) == LL_FDCAN_DLC_BYTES_48) || ((__VALUE__) == LL_FDCAN_DLC_BYTES_64))

#define IS_LL_FDCAN_ESI(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_ESI_ACTIVE) || ((__VALUE__) == LL_FDCAN_ESI_PASSIVE))

#define IS_LL_FDCAN_BRS(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_BRS_OFF) || ((__VALUE__) == LL_FDCAN_BRS_ON))

#define IS_LL_FDCAN_FDF(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_CLASSIC_CAN) || ((__VALUE__) == LL_FDCAN_FD_CAN))

#define IS_LL_FDCAN_EFC(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_NO_TX_EVENTS) || ((__VALUE__) == LL_FDCAN_STORE_TX_EVENTS))

#define IS_LL_FDCAN_RX_FIFO(__VALUE__) \
    (((__VALUE__) == LL_FDCAN_RX_FIFO0) || ((__VALUE__) == LL_FDCAN_RX_FIFO1))
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
static void FDCAN_CopyMessageToRAM(
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_TxHeaderTypeDef* TxHeader,
    const uint8_t* TxData,
    uint32_t BufferIndex);

/* Exported functions --------------------------------------------------------*/
/** @addtogroup FDCAN_LL_Exported_Functions
  * @{
  */

/** @addtogroup FDCAN_LL_EF_Init
  * @{
  */

/**
  * @brief  De-initialize the FDCAN registers to their default reset values.
  * @param  FDCANx FDCAN Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: FDCAN registers are de-initialized
  *          - ERROR: FDCAN registers are not de-initialized
  */
ErrorStatus LL_FDCAN_DeInit(const FDCAN_GlobalTypeDef* FDCANx) {
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param(IS_LL_FDCAN_ALL_INSTANCE(FDCANx));

#if defined(FDCAN1)
    if(FDCANx == FDCAN1) {
        /* Force reset of FDCAN clock */
        LL_APB1_GRP2_ForceReset(LL_APB1_GRP2_PERIPH_FDCAN1);

        /* Release reset of FDCAN clock */
        LL_APB1_GRP2_ReleaseReset(LL_APB1_GRP2_PERIPH_FDCAN1);

        status = SUCCESS;
    }
#endif /* FDCAN1 */

    return status;
}

/**
  * @brief  Initialize the FDCAN registers according to the specified parameters in FDCAN_InitStruct.
  * @param  FDCANx FDCAN Instance
  * @param  FDCAN_InitStruct pointer to a @ref LL_FDCAN_InitTypeDef structure
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: FDCAN registers are initialized
  *          - ERROR: FDCAN registers are not initialized
  */
ErrorStatus LL_FDCAN_Init(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_InitTypeDef* FDCAN_InitStruct,
    LL_FDCAN_MessageRAMTypeDef* MessageRAM) {
    ErrorStatus status = ERROR;
    uint32_t counter;

    /* Check the parameters */
    assert_param(IS_LL_FDCAN_ALL_INSTANCE(FDCANx));
    assert_param(IS_LL_FDCAN_CKDIV(FDCAN_InitStruct->ClockDivider));
    assert_param(IS_LL_FDCAN_FRAME_FORMAT(FDCAN_InitStruct->FrameFormat));
    assert_param(IS_LL_FDCAN_MODE(FDCAN_InitStruct->Mode));
    assert_param(IS_LL_FDCAN_STATE(FDCAN_InitStruct->AutoRetransmission));
    assert_param(IS_LL_FDCAN_STATE(FDCAN_InitStruct->TransmitPause));
    assert_param(IS_LL_FDCAN_STATE(FDCAN_InitStruct->ProtocolException));
    assert_param(IS_LL_FDCAN_NOMINAL_PRESCALER(FDCAN_InitStruct->NominalPrescaler));
    assert_param(IS_LL_FDCAN_NOMINAL_SJW(FDCAN_InitStruct->NominalSyncJumpWidth));
    assert_param(IS_LL_FDCAN_NOMINAL_TSEG1(FDCAN_InitStruct->NominalTimeSeg1));
    assert_param(IS_LL_FDCAN_NOMINAL_TSEG2(FDCAN_InitStruct->NominalTimeSeg2));
    assert_param(IS_LL_FDCAN_DATA_PRESCALER(FDCAN_InitStruct->DataPrescaler));
    assert_param(IS_LL_FDCAN_DATA_SJW(FDCAN_InitStruct->DataSyncJumpWidth));
    assert_param(IS_LL_FDCAN_DATA_TSEG1(FDCAN_InitStruct->DataTimeSeg1));
    assert_param(IS_LL_FDCAN_DATA_TSEG2(FDCAN_InitStruct->DataTimeSeg2));
    assert_param(IS_LL_FDCAN_MAX_VALUE(FDCAN_InitStruct->StdFiltersNbr, SRAMCAN_FLS_NBR));
    assert_param(IS_LL_FDCAN_MAX_VALUE(FDCAN_InitStruct->ExtFiltersNbr, SRAMCAN_FLE_NBR));
    assert_param(IS_LL_FDCAN_TX_FIFO_QUEUE_MODE(FDCAN_InitStruct->TxFifoQueueMode));

    /* Exit from sleep mode */
    LL_FDCAN_ExitSleep(FDCANx);

    counter = LL_FDCAN_TIMEOUT_VALUE;
    while(LL_FDCAN_IsActiveFlag_CSA(FDCANx) != 0UL) {
        if(counter == 0UL) {
            return ERROR;
        }
        counter--;
    }

    /* Request initialization mode */
    LL_FDCAN_RequestInit(FDCANx);

    counter = LL_FDCAN_TIMEOUT_VALUE;
    while(LL_FDCAN_IsActiveFlag_INIT(FDCANx) == 0UL) {
        if(counter == 0UL) {
            return ERROR;
        }
        counter--;
    }

    /* Enable configuration change */
    LL_FDCAN_EnableConfigurationChange(FDCANx);

    LL_FDCAN_SetClockDivider(FDCAN_InitStruct->ClockDivider);

