STMicroelectronics/stm32u5xx-hal-driver/Src/stm32u5xx_ll_fdcan.c
    MODIFY_REG(
        FDCANx->CCCR,
        FDCAN_CCCR_DAR | FDCAN_CCCR_TXP | FDCAN_CCCR_PXHD,
        FDCAN_InitStruct->AutoRetransmission | FDCAN_InitStruct->TransmitPause |
            FDCAN_InitStruct->ProtocolException);

    LL_FDCAN_SetFrameFormat(FDCANx, FDCAN_InitStruct->FrameFormat);

    /* Reset operating mode */
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_TEST | FDCAN_CCCR_MON | FDCAN_CCCR_ASM);
    CLEAR_BIT(FDCANx->TEST, FDCAN_TEST_LBCK);

    if(FDCAN_InitStruct->Mode == LL_FDCAN_MODE_RESTRICTED_OPERATION) {
        SET_BIT(FDCANx->CCCR, FDCAN_CCCR_ASM);
    } else if(FDCAN_InitStruct->Mode != LL_FDCAN_MODE_NORMAL) {
        if(FDCAN_InitStruct->Mode != LL_FDCAN_MODE_BUS_MONITORING) {
            SET_BIT(FDCANx->CCCR, FDCAN_CCCR_TEST);
            SET_BIT(FDCANx->TEST, FDCAN_TEST_LBCK);

            if(FDCAN_InitStruct->Mode == LL_FDCAN_MODE_INTERNAL_LOOPBACK) {
                SET_BIT(FDCANx->CCCR, FDCAN_CCCR_MON);
            }
        } else {
            SET_BIT(FDCANx->CCCR, FDCAN_CCCR_MON);
        }
    } else {
        /* Nothing to do: normal mode */
    }

    LL_FDCAN_SetNominalBitTiming(
        FDCANx,
        FDCAN_InitStruct->NominalPrescaler,
        FDCAN_InitStruct->NominalSyncJumpWidth,
        FDCAN_InitStruct->NominalTimeSeg1,
        FDCAN_InitStruct->NominalTimeSeg2);

    LL_FDCAN_SetDataBitTiming(
        FDCANx,
        FDCAN_InitStruct->DataPrescaler,
        FDCAN_InitStruct->DataSyncJumpWidth,
        FDCAN_InitStruct->DataTimeSeg1,
        FDCAN_InitStruct->DataTimeSeg2);

    LL_FDCAN_SetTxFifoQueueMode(FDCANx, FDCAN_InitStruct->TxFifoQueueMode);

    LL_FDCAN_ConfigMessageRAM(
        FDCANx, FDCAN_InitStruct->StdFiltersNbr, FDCAN_InitStruct->ExtFiltersNbr, MessageRAM);

    status = SUCCESS;

    return status;
}

/**
  * @brief  Set each @ref LL_FDCAN_InitTypeDef field to default value.
  * @param  FDCAN_InitStruct pointer to a @ref LL_FDCAN_InitTypeDef structure
  * @retval None
  */
void LL_FDCAN_StructInit(LL_FDCAN_InitTypeDef* FDCAN_InitStruct) {
    FDCAN_InitStruct->ClockDivider = LL_FDCAN_CLOCK_DIV1;
    FDCAN_InitStruct->FrameFormat = LL_FDCAN_FRAME_CLASSIC;
    FDCAN_InitStruct->Mode = LL_FDCAN_MODE_NORMAL;
    FDCAN_InitStruct->AutoRetransmission = LL_FDCAN_AUTO_RETRANSMISSION_ENABLE;
    FDCAN_InitStruct->TransmitPause = LL_FDCAN_TRANSMIT_PAUSE_DISABLE;
    FDCAN_InitStruct->ProtocolException = LL_FDCAN_PROTOCOL_EXCEPTION_ENABLE;
    FDCAN_InitStruct->NominalPrescaler = 1U;
    FDCAN_InitStruct->NominalSyncJumpWidth = 1U;
    FDCAN_InitStruct->NominalTimeSeg1 = 2U;
    FDCAN_InitStruct->NominalTimeSeg2 = 2U;
    FDCAN_InitStruct->DataPrescaler = 1U;
    FDCAN_InitStruct->DataSyncJumpWidth = 1U;
    FDCAN_InitStruct->DataTimeSeg1 = 1U;
    FDCAN_InitStruct->DataTimeSeg2 = 1U;
    FDCAN_InitStruct->StdFiltersNbr = 0U;
    FDCAN_InitStruct->ExtFiltersNbr = 0U;
    FDCAN_InitStruct->TxFifoQueueMode = LL_FDCAN_TX_FIFO_OPERATION;
}

/**
  * @brief  Set each @ref LL_FDCAN_MessageRAMTypeDef field to default value.
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @retval None
  */
void LL_FDCAN_MessageRAMStructInit(LL_FDCAN_MessageRAMTypeDef* MessageRAM) {
    MessageRAM->StandardFilterSA = SRAMCAN_BASE + SRAMCAN_FLSSA;
    MessageRAM->ExtendedFilterSA = SRAMCAN_BASE + SRAMCAN_FLESA;
    MessageRAM->RxFIFO0SA = SRAMCAN_BASE + SRAMCAN_RF0SA;
    MessageRAM->RxFIFO1SA = SRAMCAN_BASE + SRAMCAN_RF1SA;
    MessageRAM->TxEventFIFOSA = SRAMCAN_BASE + SRAMCAN_TEFSA;
    MessageRAM->TxFIFOQSA = SRAMCAN_BASE + SRAMCAN_TFQSA;
}

/**
  * @}
  */

/** @addtogroup FDCAN_LL_EF_Message_RAM
  * @{
  */

/**
  * @brief  Configure the FDCAN message RAM block addresses and filter list sizes.
  * @param  FDCANx FDCAN Instance
  * @param  StdFiltersNbr Number of standard filters
  * @param  ExtFiltersNbr Number of extended filters
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @retval None
  */
void LL_FDCAN_ConfigMessageRAM(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t StdFiltersNbr,
    uint32_t ExtFiltersNbr,
    LL_FDCAN_MessageRAMTypeDef* MessageRAM) {
    assert_param(IS_LL_FDCAN_ALL_INSTANCE(FDCANx));
    assert_param(IS_LL_FDCAN_MAX_VALUE(StdFiltersNbr, SRAMCAN_FLS_NBR));
    assert_param(IS_LL_FDCAN_MAX_VALUE(ExtFiltersNbr, SRAMCAN_FLE_NBR));

    LL_FDCAN_MessageRAMStructInit(MessageRAM);
    LL_FDCAN_SetFilterListSize(FDCANx, StdFiltersNbr, ExtFiltersNbr);
    LL_FDCAN_FlushMessageRAM();
}

/**
  * @brief  Flush the fixed FDCAN message RAM area.
  * @retval None
  */
void LL_FDCAN_FlushMessageRAM(void) {
    uint32_t ram_counter;

    for(ram_counter = SRAMCAN_BASE; ram_counter < (SRAMCAN_BASE + SRAMCAN_SIZE);
        ram_counter += 4U) {
        *(uint32_t*)ram_counter = 0x00000000UL;
    }
}

/**
  * @brief  Configure an FDCAN reception filter in message RAM.
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @param  FilterConfig pointer to a @ref LL_FDCAN_FilterTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: filter is configured
  *          - ERROR: filter is not configured
  */
ErrorStatus LL_FDCAN_ConfigFilter(
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_FilterTypeDef* FilterConfig) {
    uint32_t filter_element_w1;
    uint32_t filter_element_w2;
    uint32_t* filter_address;

    assert_param(IS_LL_FDCAN_ID_TYPE(FilterConfig->IdType));
    assert_param(IS_LL_FDCAN_FILTER_CFG(FilterConfig->FilterConfig));

    if(FilterConfig->IdType == LL_FDCAN_STANDARD_ID) {
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterIndex, SRAMCAN_FLS_NBR - 1U));
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterID1, 0x7FFU));
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterID2, 0x7FFU));
        assert_param(IS_LL_FDCAN_STD_FILTER_TYPE(FilterConfig->FilterType));

        filter_element_w1 =
            ((FilterConfig->FilterType << 30U) | (FilterConfig->FilterConfig << 27U) |
             (FilterConfig->FilterID1 << 16U) | FilterConfig->FilterID2);

