STMicroelectronics/stm32u5xx-hal-driver/Src/stm32u5xx_ll_fdcan.c
        filter_address = (uint32_t*)(MessageRAM->StandardFilterSA +
                                     (FilterConfig->FilterIndex * SRAMCAN_FLS_SIZE));
        *filter_address = filter_element_w1;
    } else {
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterIndex, SRAMCAN_FLE_NBR - 1U));
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterID1, 0x1FFFFFFFU));
        assert_param(IS_LL_FDCAN_MAX_VALUE(FilterConfig->FilterID2, 0x1FFFFFFFU));
        assert_param(IS_LL_FDCAN_EXT_FILTER_TYPE(FilterConfig->FilterType));

        filter_element_w1 = ((FilterConfig->FilterConfig << 29U) | FilterConfig->FilterID1);
        filter_element_w2 = ((FilterConfig->FilterType << 30U) | FilterConfig->FilterID2);

        filter_address = (uint32_t*)(MessageRAM->ExtendedFilterSA +
                                     (FilterConfig->FilterIndex * SRAMCAN_FLE_SIZE));
        *filter_address = filter_element_w1;
        filter_address++;
        *filter_address = filter_element_w2;
    }

    return SUCCESS;
}

/**
  * @brief  Add a message to the Tx FIFO/Queue and activate transmission request.
  * @param  FDCANx FDCAN Instance
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @param  TxHeader pointer to a @ref LL_FDCAN_TxHeaderTypeDef structure
  * @param  TxData pointer to a buffer containing the payload
  * @param  TxBufferIndex pointer to the Tx buffer bit index used for this request.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: message is queued
  *          - ERROR: Tx FIFO/Queue is full
  */
ErrorStatus LL_FDCAN_AddMessageToTxFifoQ(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_TxHeaderTypeDef* TxHeader,
    const uint8_t* TxData,
    uint32_t* TxBufferIndex) {
    uint32_t put_index;
    uint32_t tx_buffer_index;

    assert_param(IS_LL_FDCAN_ALL_INSTANCE(FDCANx));
    assert_param(IS_LL_FDCAN_ID_TYPE(TxHeader->IdType));
    if(TxHeader->IdType == LL_FDCAN_STANDARD_ID) {
        assert_param(IS_LL_FDCAN_MAX_VALUE(TxHeader->Identifier, 0x7FFU));
    } else {
        assert_param(IS_LL_FDCAN_MAX_VALUE(TxHeader->Identifier, 0x1FFFFFFFU));
    }
    assert_param(IS_LL_FDCAN_FRAME_TYPE(TxHeader->TxFrameType));
    assert_param(IS_LL_FDCAN_DLC(TxHeader->DataLength));
    assert_param(IS_LL_FDCAN_ESI(TxHeader->ErrorStateIndicator));
    assert_param(IS_LL_FDCAN_BRS(TxHeader->BitRateSwitch));
    assert_param(IS_LL_FDCAN_FDF(TxHeader->FDFormat));
    assert_param(IS_LL_FDCAN_EFC(TxHeader->TxEventFifoControl));
    assert_param(IS_LL_FDCAN_MAX_VALUE(TxHeader->MessageMarker, 0xFFU));

    if(LL_FDCAN_IsActiveFlag_TxFifoFull(FDCANx) != 0UL) {
        return ERROR;
    }

    put_index = LL_FDCAN_GetTxFifoQueuePutIndex(FDCANx);
    tx_buffer_index = (1UL << put_index);

    FDCAN_CopyMessageToRAM(MessageRAM, TxHeader, TxData, put_index);
    LL_FDCAN_AddTxRequest(FDCANx, tx_buffer_index);

    if(TxBufferIndex != NULL) {
        *TxBufferIndex = tx_buffer_index;
    }

    return SUCCESS;
}

/**
  * @brief  Get an FDCAN frame from an Rx FIFO message RAM element.
  * @param  FDCANx FDCAN Instance
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @param  RxFifo This parameter can be a value of @ref FDCAN_LL_EC_RX_FIFO
  * @param  RxHeader pointer to a @ref LL_FDCAN_RxHeaderTypeDef structure
  * @param  RxData pointer to a buffer where payload will be copied
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: message is read
  *          - ERROR: Rx FIFO is empty
  */
ErrorStatus LL_FDCAN_GetRxMessage(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    uint32_t RxFifo,
    LL_FDCAN_RxHeaderTypeDef* RxHeader,
    uint8_t* RxData) {
    uint32_t* rx_address;
    uint8_t* pdata;
    uint32_t byte_counter;
    uint32_t get_index = 0U;

    assert_param(IS_LL_FDCAN_ALL_INSTANCE(FDCANx));
    assert_param(IS_LL_FDCAN_RX_FIFO(RxFifo));

    if(RxFifo == LL_FDCAN_RX_FIFO0) {
        if(READ_BIT(FDCANx->RXF0S, FDCAN_RXF0S_F0FL) == 0UL) {
            return ERROR;
        }

        if((READ_BIT(FDCANx->RXF0S, FDCAN_RXF0S_F0F) >> FDCAN_RXF0S_F0F_Pos) == 1UL) {
            if((READ_BIT(FDCANx->RXGFC, FDCAN_RXGFC_F0OM) >> FDCAN_RXGFC_F0OM_Pos) ==
               LL_FDCAN_RX_FIFO_OVERWRITE) {
                get_index = 1U;
            }
        }

        get_index += (READ_BIT(FDCANx->RXF0S, FDCAN_RXF0S_F0GI) >> FDCAN_RXF0S_F0GI_Pos);
        rx_address = (uint32_t*)(MessageRAM->RxFIFO0SA + (get_index * SRAMCAN_RF0_SIZE));
    } else {
        if(READ_BIT(FDCANx->RXF1S, FDCAN_RXF1S_F1FL) == 0UL) {
            return ERROR;
        }

        if((READ_BIT(FDCANx->RXF1S, FDCAN_RXF1S_F1F) >> FDCAN_RXF1S_F1F_Pos) == 1UL) {
            if((READ_BIT(FDCANx->RXGFC, FDCAN_RXGFC_F1OM) >> FDCAN_RXGFC_F1OM_Pos) ==
               LL_FDCAN_RX_FIFO_OVERWRITE) {
                get_index = 1U;
            }
        }

        get_index += (READ_BIT(FDCANx->RXF1S, FDCAN_RXF1S_F1GI) >> FDCAN_RXF1S_F1GI_Pos);
        rx_address = (uint32_t*)(MessageRAM->RxFIFO1SA + (get_index * SRAMCAN_RF1_SIZE));
    }

    RxHeader->IdType = *rx_address & FDCAN_ELEMENT_MASK_XTD;
    if(RxHeader->IdType == LL_FDCAN_STANDARD_ID) {
        RxHeader->Identifier = ((*rx_address & FDCAN_ELEMENT_MASK_STDID) >> 18U);
    } else {
        RxHeader->Identifier = (*rx_address & FDCAN_ELEMENT_MASK_EXTID);
    }

    RxHeader->RxFrameType = (*rx_address & FDCAN_ELEMENT_MASK_RTR);
    RxHeader->ErrorStateIndicator = (*rx_address & FDCAN_ELEMENT_MASK_ESI);

    rx_address++;

    RxHeader->RxTimestamp = (*rx_address & FDCAN_ELEMENT_MASK_TS);
    RxHeader->DataLength = ((*rx_address & FDCAN_ELEMENT_MASK_DLC) >> 16U);
    RxHeader->BitRateSwitch = (*rx_address & FDCAN_ELEMENT_MASK_BRS);
    RxHeader->FDFormat = (*rx_address & FDCAN_ELEMENT_MASK_FDF);
    RxHeader->FilterIndex = ((*rx_address & FDCAN_ELEMENT_MASK_FIDX) >> 24U);
    RxHeader->IsFilterMatchingFrame = ((*rx_address & FDCAN_ELEMENT_MASK_ANMF) >> 31U);

