STMicroelectronics/stm32u5xx-hal-driver/Src/stm32u5xx_ll_fdcan.c
    rx_address++;

    pdata = (uint8_t*)rx_address;
    for(byte_counter = 0U; byte_counter < DLCtoBytes[RxHeader->DataLength]; byte_counter++) {
        RxData[byte_counter] = pdata[byte_counter];
    }

    if(RxFifo == LL_FDCAN_RX_FIFO0) {
        WRITE_REG(FDCANx->RXF0A, get_index);
    } else {
        WRITE_REG(FDCANx->RXF1A, get_index);
    }

    return SUCCESS;
}

/**
  * @brief  Convert an FDCAN data length code to a number of payload bytes.
  * @param  DataLength This parameter can be a value of @ref FDCAN_LL_EC_DATA_LENGTH
  * @retval Number of bytes.
  */
uint32_t LL_FDCAN_DLCToBytes(uint32_t DataLength) {
    assert_param(IS_LL_FDCAN_DLC(DataLength));
    return DLCtoBytes[DataLength];
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Copy Tx message to the message RAM.
  * @param  MessageRAM pointer to a @ref LL_FDCAN_MessageRAMTypeDef structure
  * @param  TxHeader pointer to a @ref LL_FDCAN_TxHeaderTypeDef structure
  * @param  TxData pointer to a buffer containing the payload
  * @param  BufferIndex index of the buffer to be configured
  * @retval None
  */
static void FDCAN_CopyMessageToRAM(
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_TxHeaderTypeDef* TxHeader,
    const uint8_t* TxData,
    uint32_t BufferIndex) {
    uint32_t tx_element_w1;
    uint32_t tx_element_w2;
    uint32_t* tx_address;
    uint32_t byte_counter;

    if(TxHeader->IdType == LL_FDCAN_STANDARD_ID) {
        tx_element_w1 =
            (TxHeader->ErrorStateIndicator | LL_FDCAN_STANDARD_ID | TxHeader->TxFrameType |
             (TxHeader->Identifier << 18U));
    } else {
        tx_element_w1 =
            (TxHeader->ErrorStateIndicator | LL_FDCAN_EXTENDED_ID | TxHeader->TxFrameType |
             TxHeader->Identifier);
    }

    tx_element_w2 =
        ((TxHeader->MessageMarker << 24U) | TxHeader->TxEventFifoControl | TxHeader->FDFormat |
         TxHeader->BitRateSwitch | (TxHeader->DataLength << 16U));

    tx_address = (uint32_t*)(MessageRAM->TxFIFOQSA + (BufferIndex * SRAMCAN_TFQ_SIZE));

    *tx_address = tx_element_w1;
    tx_address++;
    *tx_address = tx_element_w2;
    tx_address++;

    for(byte_counter = 0U; byte_counter < DLCtoBytes[TxHeader->DataLength]; byte_counter += 4U) {
        *tx_address =
            (((uint32_t)TxData[byte_counter + 3U] << 24U) |
             ((uint32_t)TxData[byte_counter + 2U] << 16U) |
             ((uint32_t)TxData[byte_counter + 1U] << 8U) | (uint32_t)TxData[byte_counter]);
        tx_address++;
    }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(FDCAN1) */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */
